import 'package:flutter/material.dart';
import 'package:graduation_pro/Const/const.dart';

class ArtEducation extends StatelessWidget {
  const ArtEducation({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 55,
        backgroundColor: MyColors.blue,
        title: Text(
          "ArtEducation",
          style: TextStyle(fontSize: 40),
        ),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(12),
          child: Column(
            children: [
              Container(
                width: MediaQuery.of(context).size.width,
                child:
                    Image.asset('assets/images/Art/Art1.jpg', fit: BoxFit.fill),
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "•	رسالة القسم:",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  "نشر الوعي الفني و الثقافي في الوسط الاجتماعي و تطوير مهارات الطلبة في التخصصات الفنية و الانفتاح المعرفي الإبداعي على المجتمع  العربي و الدولي و الإسهام في خلق واقع فني ثقافي ينسجم مع التوجه الحضاري الجديد .  "),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "•	رؤية القسم   ",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  "_ ان غاية التربية الفنية التي ننشدها في المدارس هي تربية الفرد ليستطيع ان يعيش عيشة جمالية راقية وسط الاطار الاجتماعي المتطور الذي ينتمي إلية و مادة الفن ماهي الا وسيلة للوصول الى التكوين العام الشامل للطلاب و ليس هدفها تكوين المهارة اليدوية فقط بل هو ايجاد نوع من الخبرة المتكاملة في مراحل التعليم المختلفة.\n_ ويتمثل دور مدرس التربية الفنية في العملية التربوية في تهيئة المجال المحيط بالطلاب ببيئة فنية تحقق تواصله مع العصر بأدواته و أفكاره لكي يفكر و يعي و يعمل و ينمو عبر نشاطه المدرسي و الاجتماعي في الاتجاه الصحيح.\n_ ولعل ذلك يوضح الدور الذي يقع على عاتق مدرس التربية الفنية الذي يكاد ان يحمل عبئ العملية التعليمية في التربية الفنية فهو المسؤول المباشر عن تحقيق اهدافها العريضة و صياغتها من خلال البيئة المحيطة به بمشاركة مع طلابه و مدى إمكاناتهم الذاتية و استعداداتهم الفطرية و الجسمية و المعرفية و ما يهيئه لهم من مبادرات ذاتية و أدوات و خامات للخوض عبر ذلك المجال.\n_ وإذا كانت الأهداف العامة و الخاصة للتربية الفنية و الخطوط العريضة للمنهج و استراتيجيات التعليم و الطريقة قد تحددت أطرها العامة فان المبادرات الخاصة لمدرس المادة و تفسيره للمنهج و اختياره لأولويات الأهداف و الخبرات التقنية و المعارف العلمية المرتبطة بالمادة و أسلوبه الذاتي في تقديم كل ذلك من خلال خطط و وحدات دراسية يمثل حجر الزاوية في ذلك المجال\n"),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "•	الأهداف العامة لقسم التربية الفنية",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  "1-	تربية الفرد ليعيش عيشة جمالية راقية وسط الإطار الاجتماعي المتطور و تعميق المناهج و القيم الاجتماعية البناءة في نفوس الطلبة إثناء ممارسهم للعمل الفني و النشاطات الصفية و اللاصفية.\n2-	الكشف عن الطلاب الموهوبين وتنمية مواهبهم و قدراتهم الفنية و المهنية .\n3-	تأكيد ذاتية الطلاب و إتاحة الفرصة للتعبير عن انفعالاتهم و مشاعرهم و تكوين شخصياتهم .\n4-	القدرة على الملاحظة و الرؤية الدقيقة و النقد و التذوق الفني الهادف .\n5-	اكتساب الخبرات و المهارات المتدرجة التي تتلائم مع اعمار الطلاب و مستوياتهم و ربطهم ببيئتهم و السير بالثقافة الفنية في مجالات تراثنا الشعبي .\n6-	احترام العمل اليدوي و من يقومون به.\n7-	مساعدة الطلاب على استخدام بعض الخامات المحلية المختلفة حسب اختيارهم في التعبير عن الموضوعات تتصل بحياتهم العامة.\n8-	تنمية الذوق و الإحساس الفني عند الطلاب و الاستمتاع بالقيم الجمالية و معرفة مواطن الجمال في الأشياء.\n9-	تنمية روح التعاون و العمل الجماعي وذلك من خلال العمل على شكل مجموعات .\n10-	إبراز الطابع الخاص في التعبير الفني مما يكون له تأثير ايجابي في تكامل الشخصية , فالفن عملية تجديد وابتكار وليس نقلا حرفيا .\n"),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "•	الأهداف الخاصة لقسم التربية الفنية",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  "1-	أعداد مدرس للتربية الفنية مؤهل لتدريسها في المرحلة الثانوية يحمل شهادة البكالوريوس في التربية الفنية .\n2-	أعداد باحثين متخصصين في مجال التربية الفنية يقومون بالبحث و التجريب في مجالات التربية الفنية و الجمالية بمختلف مستويات مراحل التعليم العام و التعليم الجامعي بهدف تطوير مكونات العملية التعليمية .\n3-	أعداد متخصصين قادرين على إعداد برامج التدريب للعاملين في مجالات التربية الفنية (تأهيل مدرسي المادة أثناء الخدمة).\n4-	أعداد متخصصين قادرين على تنفيذ و تقديم برنامج التربية الجمالية و دورها في تنمية المجتمع من خلال و سائل الإعلام و الاتصال المختلفة .\n"
                  "ماذا يعمل خريج تربية النوعية للخريجين العمل بإحدى الوظائف التالية: مدرسين اقتصاد منزلي في مراحل التعليم قبل الجامعي. العمل في مجال التغذية وعلوم الأطعمة في المصانع المختلفة أو الملابس والنسيج وإدارة شؤون الأسرة ."),
              SizedBox(
                height: 12,
              ),
            ],
          ),
        ),
      ),
    );
  }
}
