import 'package:flutter/material.dart';
import 'package:graduation_pro/Const/const.dart';

class MediaDepartment extends StatelessWidget {
  const MediaDepartment({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 55,
        backgroundColor: MyColors.blue,
        title: Text(
          "MediaDepartment",
          style: TextStyle(fontSize: 40),
        ),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(12),
          child: Column(
            children: [
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "رؤية ورسالة قسم الاعلام التربوي",
                style: TextStyle(fontSize: 50),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  "يسعى القسم إلى إعداد كوادر إعلامية مؤهلة معرفياً ومهارياً وقيمياً وقادرة على ممارسة مهام وأدوار الإعلام والمسرح المدرسى داخل المؤسسات التربوية وخارجها وتعمل على تطوير أدائها المهني من خلال الدراسات والبحوث فى مجالات التخصص ومتابعة المستجدات على الساحتين المحلية والعالمية والمشاركة فى المجتمعات المهنية المتخصصة بما يواكب متطلبات الجودة وسوق العمل ويلبى احتياجات المجتمع المحلى ويتفق مع رسالة ورؤية الكلية وأخلاقيات العمل الإعلامى ومواثيقة. ويشرف على القسم أ. د/ سلام أحمد عبده إعداد أخصائى إعلام تربوى (صحافة وإذاعة وتليفزيون ومسرح مدرسى) لمراحل التعليم المختلفه إعدادا مهنيا وإكسابه مجموعه من المعارف  والمهارات والقيم التى \nتؤهله للتدريس والمشاركة المجتمعية والإبداع فى مجال التخصص والتعلم الذاتى والمنافسة فى سوق العمل على أن يتصف بمجموعة من الصفات أهمها : -\n_	اكتساب مهارات الاتصال الفعال.\n_	فهم طبيعة العمل الإعلامى والعوامل البيئية المؤثره فيه (مجتمعيا وتكنولوجيا وفنيا واقتصاديا )\n_	اكتساب مهارة ممارسة العمل الصحفى فى صحيفة ورقية والكترونية داخل المؤسسات التربوية بمهارة وكفاءة.\n_	اكتساب مهارة ممارسة العمل الإذاعى وسيلة إذاعية أو تليفزيونية داخل المؤسسة التربوية بمهارة وكفاءة.\n\_	فهم تأثيرات الإعلام ( الصحفى و الإذاعى والتلفزيونى ) سلبا أو إيجابيا وفق نظريات الاتصال المعاصرة واستخدامها فى بناء رسائل إعلامية قادرة على تحقيق الأهداف التعليمية .\n_	تقييم ونقد الممارسات الصحفية والإذاعية والتليفزيونية فى ضوء أخلاقيات المهنة وقواعد ما ينبغى أن يكون .\n_	إجادة مهارات الأداء الإذاعى والتلفزيونى\n-مدة الدراسة اربع سنوات .\n -الدراسة نظرية وتطبيقية\n_	يتم تشعيب الطلاب المنقولين من الفرقة الثانية في شعبة الاعلام التربوي إلي :\n-شعبة صحافة وأذاعة وتليفزيون\n-شعبة المسرح المدرسي\n_	وذلك بناء علي : رغبة الطالب – مجموع الدرجات الكلية بالفرقة الثانية – الاعداد التي يحددها مجلس الكلية كل عام ..\n "),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "  اهداف القسم  ",
                style: TextStyle(fontSize: 50),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  " يهدف برنامج الإعلام التربوي  المسرح المدرسي وصحافة وإذاعة وتلفزيون لتحقيق الأهداف التالية:\n1/1 - العمل على إيجاد الكوادر المؤهلة في مجالات الإعلام التربوي المختلفة.\n1/2 - تزويد الطالب بالمفاهيم والمعارف الأساسية في مجالات الإعلام والاتصال وتطبيقاتها المختلفة.\n1/3 تنمية القدرات الذهنية و المهارات المهنية لدي الطالب في مجالات الإعلام التربوي المختلفة.\n1/4 تزويد الطالب بالمهارات العملية والتطبيقية في مجالات الإعلام التربوي المختلفة.\n1/5 إكساب الطالب القدرة على توظيف المكونات المعرفية والفكرية في مجالات الإعلام التربوي في حياته المهنية والعامة.\n1/6 تنمية الوعي بدور الإعلام التربوي ومجالاته في العملية التعليمية وخدمة وتنمية المجتمع.\n1/7 توظيف الطالب لمعارفه بالعلوم الإعلامية المعاصرة بأنواعها في الارتقاء بفكرة وإبداعه في المجال الإعلامي والتربوي وتطبيقاتها.\n1/8 زيادة قدرة الطالب على توظيف أسس وقواعد وتطبيقات العلوم الإعلامية المختلفة.\n1/9 الوعي بدور وأهمية الإعلام التربوي ومجالاته المختلفة في التربية الإعلامية وميادينها.\n1/10 تنمية قدرة الطالب على تحليل وتصنيف وسائل الإعلام والاتصال وبيئاتها المختلفة: محلياً وإقليمياً، ودولياً وتأثيراتها.\n1/11 تنمية وعي الطالب بدوره ومسئولياته المهنية والمجتمعية.\n1/12 تنمية الوعي بالمتغيرات المجتمعية على المستويات المحلية والإقليمية والدولية والعلاقات بينها.\n1/13 الوعي بدور وأهمية الإعلام والاتصال ووظائفه في المجتمع.\n1/14 تزويد الطالب بإستراتيجية الإعلام الإذاعي والتلفزيوني.\n1/15 الوعي بدور وأهمية وسائل الإعلام في التنمية الشاملة.\n\1/16 تنمية وعي الطالب بدور وسائل الإعلام في تكوين الرأي العام.\n1/17 الإلمام بعناصر البناء الدرامي وأهمية الدراما في البناء الثقافي والاجتماعي للفرد.\n1/18 توظيف الأعمال الإذاعية والتلفزيونية في تطوير العملية التعليمية وخدمة المجتمع.\n1/19 توظيف الطالب لأسس ومهارات التحرير الصحفي وفنونه في إنتاج المواد والأنشطة الإعلامية المختلفة.\n\1/20 توظيف الطالب لأسس وقواعد ومهارات التصوير الإعلامي في إنتاج المواد الإعلامية بأخلاقياته.\n1/21 الإلمام بأسس وقواعد الإخراج الصحفي.\n1/22 إكساب الطالب القدرة على إنتاج مواد وأنشطة إعلامية تعليمية مختلفة (صحف – إذاعة مدرسية مناظرات - وتنظيم المعارض والندوات... وغيرها).\n1/23 فهم التطورات الحديثة والمستجدات في مجال الإعلام التربوي وتطبيقاته.\n1/24 إكساب الطالب القدرة على كتابة وإنتاج المواد والأعمال والأنشطة الإعلامية والتربوية المختلفة بلغة سليمة وواضحة باستخدام القوالب الفنية الملائمة.\n1/25 تمكين الطالب من تحليل المضامين والأعمال والأنشطة الإعلامية المطروحة بالوسائل الإعلامية المختلفة وتقييمها وتصنيف اتجاهاتها.\n1/26 الإلمام بأسس وقواعد كتابة وتحرير المادة الإعلامية بوسائل الإعلام المختلفة.\n1/27 توظيف الأعمال والأنشطة الإعلامية والتربوية في تطوير منظومة التعليم وخدمة وتنمية المجتمع.\n1/28 استخدام الحاسب الآلي وتكنولوجيا المعلومات والاتصال ومستحدثاتها في الأعمال الإعلامية التربوية المختلفة وتطوير مهاراته المهنية.\n1/29 إكساب الطالب القدرة على إجراء البحوث والدراسات العلمية في مجالات الإعلام التربوي وتطبيقاته باستخدام الأساليب الكمية والكيفية الملائمة.\n1/30المشاركة في وضع تصورات ورؤى مستقبلية لتطوير مجالات الإعلام التربوي وتطبيقاتها المختلفة.\n1/31 تنمية وعي الطالب بأسس إدارة وتخطيط المؤسسات والأنشطة الإعلامية المختلفة وتمويلها.\n1/32 تنمية القدرة على تحليل وتقييم مبادئ وقوانين حرية التعبير التي تحكم العمل الإعلامي.\n1/33 تنمية الوعي بطبيعة وأسس وقواعد العلوم ذات العلاقة بالإعلام التربوي والعلاقات المتبادلة بينها.\n1/34 الإلمام بالمبادئ والمفاهيم الأساسية للبيانات الإحصائية المختلفة.\n1/35 تنمية مهارات الطالب في حل المشكلات المهنية والمجتمعية باستخدام الأساليب العلمية.\n1/36 تمكين الطالب من تصميم وتنفيذ المشروعات الإعلامية الصغيرة في ضوء الإمكانات المتاحة.\n1/37 توظيف الأنشطة الإعلامية المختلفة في تنمية البناء العلمي والخلقي والاجتماعي لأطراف العملي التعليمية.\n1/38 تنمية الوعي لدي الطالب بدوره في تطوير المنظومة التعليمية وخدمة وتنمية المجتمع.\n1/39 حث الطالب على تنمية ذاته مهنياً باستمرار، وبناء علاقات مهنية ناجحة.\n1/40 القدرة على التواصل بلغة عربية سليمة وإحدى اللغات الأجنبية.\n1/41 إدراك وحدة المعرفة والعلاقات المتبادلة والتكاملية بين مجالات العلوم وفروعها المختلفة.\n1/42 الوعي بالتطورات والمستحدثات في مجالات الإعلام التربوي والعلوم ذات العلاقة.\n1/43 الالتزام بضوابط وأخلاقيات وآداب المهنة والمجتمع في تعاملاته والقيام بمسئولياته تجاه تطويرها المستمر.\n1/44 المشاركة في تنمية قيم الانتماء الوطني، المواطنة، الديمقراطية، التسامح واحترام الرأي الآخر... وغيرها.\n1/45 زيادة قدرة الطالب على التواصل بفاعلية والعمل بروح الفريق واتخاذ القرار.1/46 الوعي بمقومات الهوية الثقافية للأمة ودوره في تعزيزها.\n\1/47 تصميم خطة للتدريس، وبيئات تربوية تناسب الفروق الفردية بين المتعلمين.\n1/48 التنويع في استخدام طرق التدريس وتطبيق مبادئه ونظرياته مع مراعاة خصائص المتعلمين وأنماط التعليم والتعلم.\n1/49 المشاركة في الأنشطة المجتمعية المختلفة بما يحقق الجودة والتطور.\n1/50 إكساب الطالب القدرة على إدارة المواقف التعليمية المختلفة بكفاءة وفاعلية وتنمية خبراته التعليمية والميدانية.\n1/51 توظيف آليات الإرشاد والتوجيه التربوي والنفسي، وريادة الأعمال في الممارسات المهنية المختلفة.\n"),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                " امتحان قدرات القسم  ",
                style: TextStyle(fontSize: 50),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 30),
                  textDirection: TextDirection.rtl,
                  "ينتهي الطلاب من امتحانات الثانوية العامة و بعدها يبدا التفكير في الكليات المختلفة المتاحة امامه منها الكليات التي تحتاج الي اداء اختبار القدرات , ومن الاسئلة التي تترد بين الطلاب خلال فترة البحث عن الكلية المناسبة هو هل كلية تربية نوعية لها امتحان قدرات ؟ يستطيع الطالب الاستعداد الجيد لاختبارات القدرات للكثير من الكليات المختلفة التي تشترط اداء تلك الامتحانات التي تحدد قبول او رفض للطالب في الكلية.هل قسم الاعلام التربوي بكلية تربية نوعية لها امتحان قدرات ؟يحاول العديد من الطلاب و اولياء الامور , التعرف علي قسم الاعلام التربوي كلية التربية النوعية وان كان لها امتحان قدرات ام لا , ولاجابة لا يوجد اختبار قدرات لاكن القسم لا يدخلة دبلومات يخذ فقط الثانوي العام ."),
              SizedBox(
                height: 12,
              ),

              Container(
                width: MediaQuery.of(context).size.width,
                child: Image.asset("assets/images/Media/Media1.jpg",
                    fit: BoxFit.fill),
              ),
              Text(
                " المواد الدراسية ",
                style: TextStyle(fontSize: 50),
              ),
              SizedBox(
                height: 12,
              ),
              // Text(
              //     style: TextStyle(fontSize: 30),
              //     textDirection: TextDirection.rtl,
              //     "الفرقة الاولي:\nالفصل الدراسي الاول\nمبادئ القانون وحقوق الانسان\معلم: dr.fadia Mahmoud\nاللغة العربية وادابها\nمعلم: dr.ashour Mahmoud\nتاريخ العالم الحديث والمعاصر\nمعلم: dr.mohamed Abdelbaset\nمدخل الى علوم التربوية\nمعلم: dr.mohamed seid\nمدخل الى علوم النفسية\nمعلم: dr.mayada Farouk\nمدخل الى علوم المسرح\nمعلم: dr.ahmed nabil\nمدخل الاتصال بالجماهير\nمعلم: dr.azza saeed\nمدخل الى علوم الصحافة\nمعلم: dr.fadia Mahmoud\nنشأة وسائل الاعلام وتطورها\nمعلم: dr.sallam Abdo\nالفصل الدراسي الثاني\nقراءات باللغة الأجنبيـة\n\nالاقتصاد السياسى\nالتربية الاعلامية\nمبـــادىْ وطرق تدريـــس\nادب الاطفالمدخل الى العلاقات العامــة\n.مدخل الى الراديو والتليفزيون\n.الترجمة الاعلاميــــــة\n"),

              SizedBox(
                height: 12,
              ),
              // Text(
              //     selectionColor: Color.fromARGB(3, 243, 42, 7),
              //     style: TextStyle(fontSize: 30),
              //     textAlign: TextAlign.right,
              //     textDirection: TextDirection.rtl,
              SizedBox(
                height: 12,
              ),
              // Text(
              //   textAlign: TextAlign.right,
              //   textDirection: TextDirection.rtl,
              //   "    اسماء واكواد مواد التربية الخاصة (لائحة جديدة) ",
              //   style: TextStyle(fontSize: 50),
              // ),
              // SizedBox(
              //   height: 12,
              // ),
              // Text(
              //     style: TextStyle(fontSize: 30),
              //     textAlign: TextAlign.center,
              //     textDirection: TextDirection.rtl,
              //     "           الفرقة الاولي:-\n •	الترم الاول \n 1-	مدخل الي التربية الخاصة.                                                     ((SE.1.1.1\n 2-	نظم رعاية المعوقين والموهوبين.                                            ((SE.1.1.2\n 3-	التوعية بميدان الأطفال ذوي الاحتياجات الخاصة (1).                     ((SE.1.1.3\n •	الترم الثاني\n 1-	التربية الترويحية للأطفال ذوي الاحتياجات الخاصة.                        ((SE.1.2.1\n 2-	التوعية بميدان الأطفال ذوي الاحتياجات الخاصة (2).                     ((SE.1.2.2\n 3-	التخصص النوعي لذوي الاحتياجات الخاصة.                               ((SE.1.2.3\n     الفرقة الثانية:-\n •	الترم الاول \n 1-	مدخل الي القياس النفسي.                                                     ((SE.2.1.1\n 2-	الاضطرابات الانفعالية والسلوكية للاطفال ذوي الاحتياجات الخاصة.      ((SE.2.1.2\n 3-	مجالات التخصص النوعي لذوي الاحتياجات الخاصة.                      ((SE.2.1.3\n •	الترم الثاني\n 1-	تقييم أطفال ذوي الاحتياجات الخاصة.                                        ((SE.2.2.1\n 2-	سيكولوجية نمو ذوي الاحتياجات الخاصة.                                  ((SE.2.2.2\n     الفرقة الثالثة:-\n •	الترم الاول\n 1-	تصميم البرامج الفردية والتربوية لذوي الاحتياجات الخاصة (1).       ((SE.3.1.1\n 2-	بناء وتعديل سلوك لذوي الاحتياجات الخاصة.                             ((SE.3.1.2\n 3-	تنمية قدرات ذوي الاحتياجات الخاصة.                                     ((SE.3.1.3   \n •	الترم الثاني\n 1-	اعداد البرامج الفردية والتربوية لذوي الاحتياجات الخاصة (2).         ((SE.3.2.1\n 2-	تطبيقات التخصص النوعي لذوي الاحتياجات الخاصة (1)                ((SE.3.2.2\n 3-	\n الفرقة الرابعة:-\n •	الترم الاول\n 1-	اضطرابات التواصل للأطفال ذوي الاحتياجات الخاصة.                    ((SE.4.1.1\n 2-	الارشاد النفسي والتربوي للاطفال ذوي الاحتياجات الخاصة وأسرهم.   ((SE.4.1.2\n 3-	تطبيقات التخصص النوعي لذوي الاحتياجات الخاصة (2)                ((SE.4.1.3\n •	الترم الثاني\n 1-	البرامج التأهيلية للأطفال ذوي الاحتياجات الخاصة.                       ((SE.4.2.1\n 2-	دراسة الحالة في مجال الأطفال ذوي الاحتياجات الخاصة.                ((SE.4.2.2    \n 3-	تنمية مواهب ذوي الاحتياجات الخاصة.                                    ((SE.4.2.3"),
              // SizedBox(
              //   height: 30,
              // ),
              // Text(
              //   textAlign: TextAlign.right,
              //   textDirection: TextDirection.rtl,
              //   " اعضاء هيئة التدريس في القسم :-\n",
              //   style: TextStyle(fontSize: 50),
              // ),
              // Text(
              //   style: TextStyle(fontSize: 30),
              //   textAlign: TextAlign.center,
              //   textDirection: TextDirection.rtl,
              //   " 1-أ.د/ نادية ألسيد الحسيني  (أستاذ متفرغ) \n 2-	أ.د/ أحلام رجب عبد الغفار               (أستاذ متفرغ)  (متوفية) \n 3-	أ.د/ السيد عبد القادر زيدان              (أستاذ متفرغ)\n4-	أ.د/ محمد مصطفي عبد الرازق       (أستاذ)   (اعارة الي جامعة الملك خالد بالسعودية العربية)\n 5-	أ.م.د/ مني حسين الدهان              (أستاذ مساعد متفرغ) \n 6-	د/ أمينة محمد الأبيض                  (مدرس متفرغ)  \n 7-	د/ أمل حشمت ذكي                      (مدرس)    \n 8-	د/ ميادة محمد فاروق     (مدرس)\n 9-	د/ أحمد عبد السلام                     (مدرس متفرغ)\n 10-	د/ نشأت مهدي السيد قاعود           (مدرس متفرغ)\n 11-	د/ ايمن حصافي عبد الصمد               (مدرس)\n 12-	م.م/ تغريد شعبان عوض             (مدرس مساعد)\n 13-	م.م/ دعاء صابر علي                 (مدرس مساعد)\n 14-	م.م/ زمزم مصطفي عبد السلام     (مدرس مساعد )\n 15-	م.م/ أحمد عبد السلام علي          (مدرس مساعد)\n 16-	م.م/ ولاء جمال السيد النمر         (مدرس مساعد)\n 17-	م.م/ أيه أحمد علام                  (مدرس مساعد)\n 18-	م.م/ ابتهال طارق سعيد             (مدرس مساعد)\n 19-	م/ دينا سعيد السيد محمد                (معيدة)\n 20-	م/ نور الهدي عيسي                    (معيدة) \n 21-	م/ شيماء درويش                       (معيدة)\n 22-	م/ ياسمين محمد محمود موسي       (معيدة)\n 23-	م/ مروة كمال حسن                    (معيدة)\n 24-	م/ رمزي فؤاد حمدي                   (معيد)\n 25-	م/ فايقة سلامة                         (معيدة)\n 26-	م/ بسنت محمد بهاء                  (معيدة) ",
              // ),
            ],
          ),
        ),
      ),
    );
  }
}




//TODO:names

                // "الفرقة الاولي:\nالفصل الدراسي الاول\nمبادئ القانون وحقوق الانسان\معلم: dr.fadia Mahmoud\nاللغة العربية وادابها\nمعلم: dr.ashour Mahmoud\nتاريخ العالم الحديث والمعاصر\nمعلم: dr.mohamed Abdelbaset\nمدخل الى علوم التربوية\nمعلم: dr.mohamed seid\nمدخل الى علوم النفسية\nمعلم: dr.mayada Farouk\nمدخل الى علوم المسرح\nمعلم: dr.ahmed nabil\nمدخل الاتصال بالجماهير\nمعلم: dr.azza saeed\nمدخل الى علوم الصحافة\nمعلم: dr.fadia Mahmoud\nنشأة وسائل الاعلام وتطورها\nمعلم: dr.sallam Abdo\nالفصل الدراسي الثاني\nقراءات باللغة الأجنبيـة\n\nالاقتصاد السياسى\nالتربية الاعلامية\nمبـــادىْ وطرق تدريـــس\nادب الاطفالمدخل الى العلاقات العامــة\n.مدخل الى الراديو والتليفزيون\n.الترجمة الاعلاميــــــة\n"),
