import 'package:flutter/material.dart';
import 'package:graduation_pro/Const/const.dart';

class Specialeducation extends StatelessWidget {
  Specialeducation({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        toolbarHeight: 55,
        backgroundColor: MyColors.blue,
        title: Text(
          "التربية الخاصة",
          style: TextStyle(fontSize: 40),
        ),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(12),
          child: Column(
            children: [
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "رؤية ورسالة قسم العلوم التربوية والنفسية والتربية الخاصة",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 25),
                  textDirection: TextDirection.rtl,
                  "\n   أن يكون قسم العلوم التربوية والنفسية والتربية الخاصة جامعة عين شمس له دوراً رائداً تربيوياَ ونفسياَ بالإضافة إلى تعديل إتجاهات المجتمع نحو ذوى الإحتياجات الخاصة, وكذلك في تقويم الخدمات المساندة لذوى الإحتياجات الخاصة وأسرهم.\n كما يسعى القسم إلى إعداد خريجين من الطلاب المعلمين والباحثين إعداداً تربويا ونفسياَ وأكاديميا ومهنياً قادرين على تقديم الخدمات التربوية للمؤسسات التعليمية عموماً ومؤسسات التعليم لذوى الإحتياجات الخاصة على وجه الخصوص فى مسارات ( الإعاقة العقلية – الإعاقة السمعية – الإعاقة البصرية – الموهوبين والمتفوقين – صعوبات التعلم) وذلك المواكبة لمتطلبات سوق العمل محلياً وإقليمياً ودولياً, والتميز فى البحث العلمى و المساهمة في مشاركة ذوي الاحتياجات الخاصة في المجتمع .   \n قسم العلوم التربوية والنفسية والتربية الخاصة جامعة عين شمس يسعى إلى إعداد الكوادر البشرية من معلمين و باحثين وقياديين وإداريين فى المؤسسات التعليمية عموماً ومؤسسات التعليم لذوى الإحتياجات الخاصة على وجه الخصوص ناجحين على مستوى الدراسات العليا تؤهلهم تربويا وأكاديمياً ومهنياً وثقافياً وأخلاقياً ونفسياً وفقاً للمعايير المحلية والقومية والعالمية وفقا لمعايير للجودة والاعتماد الاكاديمى فى مجال اعداد المتخصصين فى التربية الخاصة ليعملوا فى المؤسسات التربوية والنفسية والتربية الخاصة وبرامج الدمج المختلفة بكفاءة عالية ويكونوا قادرين على المناقسة فى سوق العمل او ليكونوا أعضاء فى هيئة تدريس فى الجامعات, كما يعمل القسم على إعداد البحوث العلمية التى تخدم ذوى الاحتياجات الخاصة وأسرهم وتسهم  فى خدمة المجتمع وتنمية البيئة.\n "),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "  خطوات الالتحاق بالقسم  ",
                style: TextStyle(fontSize: 40),
              ),
              Text(
                  style: TextStyle(fontSize: 25),
                  textDirection: TextDirection.rtl,
                  "  \n 1- يجب التحاقك بقسم اساسي من  ( تكنولوجيا التعليم – اعلام تربوي – اقصاد منزلي –التربية الفنيه – التربية الموسيقيه ) حسب التنسيق .\n 2-يطرح القسم استمارات التحاق يجب عليك ملئ الاستمارة  وتسليمها\n3- يتم تحديد موعد للمقابله الشخصية لقبولك في القسم يجب عليك الذهاب وحضور الموعد وانتظار قرار التحاقك او رفضك ."),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "مجالات العمل بعد التخرج ",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 25),
                  textDirection: TextDirection.rtl,
                  "\n•	 مدرب للأشخاص ذوي الاحتياجات الخاصة : وذلك بمساعدة الأشخاص المصابين بإعاقات جسدية بالقيام بتمارين تتناسب مع وضعهم سواء بشكل فردي أو ضمن مؤسسات صحية أو تعليمية أو تأهيلية أو حتى خيرية .\n•	التدريس في مدارس التربية الخاصة : وهي الوظيفة الأكثر شيوعاً لخريج التربية الخاصة والتي تقوم على تعليم حالات التربية الخاصة بطريقة تتناسب مع حالته من خلال برامج ومناهج فردية يعدها مختصين لكل حالة من الحالات.\n•	العمل في المنظمات الدولية : مثل اليونسيف واليونسكو وهي من الوظائف ذات المردود المادي العالي، حيث يعمل الخريج في هذه المنظمات على تقديم المساعدة لذوي الاحتياجات الخاصة.\n•	التخصص الأكاديمي : في حال إكمال الدراسة العليا فيمكن العمل كمدرس في كلية التربية الخاصة.\n•	البحث العلمي : وذلك بالقيام بالبحوث والدراسات وتقديم التوصيات اللازمة تفيد في تأهيل ورعاية حالات التربية الخاصة  ، سواء بشكل فردي أو ضمن مؤسسات.\n•	منسق برامج تعليمية لحالات التربية الخاصة : فمهمة الخريج هنا تكون بتصميم برامج ومناهج تساعد على تعليم حالات التربية الخاصة، ولكن هذه مسألة تتطلب تجارب وخبرة كبيرة وثقافة في حالات التربية الخاصة والتعاون مع مؤسسات مختصة.\n•	العمل في مؤسسات الرعاية الاجتماعية : مثل مؤسسات رعاية الأطفال المعوقين بأي شكل من أشكال الإعاقة أو ضحايا الكوارث والحروب، أو مؤسسات رعاية المواهب.\n•	التدريس والتدريب في المنزل : من فرص العمل المتاحة لتخصص التربية الخاصة تقديم التدريب والتعليم لذوي الاحتياجات الخاصة في المنازل. "),
              SizedBox(
                height: 12,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                "    اسماء واكواد مواد التربية الخاصة (لائحة جديدة) ",
                style: TextStyle(fontSize: 40),
              ),
              SizedBox(
                height: 12,
              ),
              Text(
                  style: TextStyle(fontSize: 25),
                  textAlign: TextAlign.right,
                  textDirection: TextDirection.rtl,
                  "           الفرقة الاولي:-\n •	الترم الاول \n 1-	مدخل الي التربية الخاصة.                                                     ((SE.1.1.1\n 2-	نظم رعاية المعوقين والموهوبين.                                            ((SE.1.1.2\n 3-	التوعية بميدان الأطفال ذوي الاحتياجات الخاصة (1).                     ((SE.1.1.3\n •	الترم الثاني\n 1-	التربية الترويحية للأطفال ذوي الاحتياجات الخاصة.                        ((SE.1.2.1\n 2-	التوعية بميدان الأطفال ذوي الاحتياجات الخاصة (2).                     ((SE.1.2.2\n 3-	التخصص النوعي لذوي الاحتياجات الخاصة.                               ((SE.1.2.3\n     الفرقة الثانية:-\n •	الترم الاول \n 1-	مدخل الي القياس النفسي.                                                     ((SE.2.1.1\n 2-	الاضطرابات الانفعالية والسلوكية للاطفال ذوي الاحتياجات الخاصة.      ((SE.2.1.2\n 3-	مجالات التخصص النوعي لذوي الاحتياجات الخاصة.                      ((SE.2.1.3\n •	الترم الثاني\n 1-	تقييم أطفال ذوي الاحتياجات الخاصة.                                        ((SE.2.2.1\n 2-	سيكولوجية نمو ذوي الاحتياجات الخاصة.                                  ((SE.2.2.2\n     الفرقة الثالثة:-\n •	الترم الاول\n 1-	تصميم البرامج الفردية والتربوية لذوي الاحتياجات الخاصة (1).       ((SE.3.1.1\n 2-	بناء وتعديل سلوك لذوي الاحتياجات الخاصة.                             ((SE.3.1.2\n 3-	تنمية قدرات ذوي الاحتياجات الخاصة.                                     ((SE.3.1.3   \n •	الترم الثاني\n 1-	اعداد البرامج الفردية والتربوية لذوي الاحتياجات الخاصة (2).         ((SE.3.2.1\n 2-	تطبيقات التخصص النوعي لذوي الاحتياجات الخاصة (1)                ((SE.3.2.2\n 3-	\n الفرقة الرابعة:-\n •	الترم الاول\n 1-	اضطرابات التواصل للأطفال ذوي الاحتياجات الخاصة.                    ((SE.4.1.1\n 2-	الارشاد النفسي والتربوي للاطفال ذوي الاحتياجات الخاصة وأسرهم.   ((SE.4.1.2\n 3-	تطبيقات التخصص النوعي لذوي الاحتياجات الخاصة (2)                ((SE.4.1.3\n •	الترم الثاني\n 1-	البرامج التأهيلية للأطفال ذوي الاحتياجات الخاصة.                       ((SE.4.2.1\n 2-	دراسة الحالة في مجال الأطفال ذوي الاحتياجات الخاصة.                ((SE.4.2.2    \n 3-	تنمية مواهب ذوي الاحتياجات الخاصة.                                    ((SE.4.2.3"),
              SizedBox(
                height: 30,
              ),
              Text(
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                " اعضاء هيئة التدريس في القسم :-\n",
                style: TextStyle(fontSize: 40),
              ),
              Text(
                style: TextStyle(fontSize: 25),
                textAlign: TextAlign.right,
                textDirection: TextDirection.rtl,
                " 1-أ.د/ نادية ألسيد الحسيني  (أستاذ متفرغ) \n 2-	أ.د/ أحلام رجب عبد الغفار(أستاذ متفرغ)  (متوفية) \n 3-	أ.د/ السيد عبد القادر زيدان(أستاذ متفرغ)\n4-	أ.د/ محمد مصطفي عبد الرازق       (أستاذ)   (اعارة الي جامعة الملك خالد بالسعودية العربية)\n 5-	أ.م.د/ مني حسين الدهان(أستاذ مساعد متفرغ) \n 6-	د/ أمينة محمد الأبيض                  (مدرس متفرغ)  \n 7-	د/ أمل حشمت ذكي                      (مدرس)    \n 8-	د/ ميادة محمد فاروق     (مدرس)\n 9-	د/ أحمد عبد السلام                     (مدرس متفرغ)\n 10-	د/ نشأت مهدي السيد قاعود           (مدرس متفرغ)\n 11-	د/ ايمن حصافي عبد الصمد               (مدرس)\n 12-	م.م/ تغريد شعبان عوض             (مدرس مساعد)\n 13-	م.م/ دعاء صابر علي                 (مدرس مساعد)\n 14-	م.م/ زمزم مصطفي عبد السلام     (مدرس مساعد )\n 15-	م.م/ أحمد عبد السلام علي          (مدرس مساعد)\n 16-	م.م/ ولاء جمال السيد النمر         (مدرس مساعد)\n 17-	م.م/ أيه أحمد علام                  (مدرس مساعد)\n 18-	م.م/ ابتهال طارق سعيد             (مدرس مساعد)\n 19-	م/ دينا سعيد السيد محمد                (معيدة)\n 20-	م/ نور الهدي عيسي                    (معيدة) \n 21-	م/ شيماء درويش                       (معيدة)\n 22-	م/ ياسمين محمد محمود موسي       (معيدة)\n 23-	م/ مروة كمال حسن                    (معيدة)\n 24-	م/ رمزي فؤاد حمدي                   (معيد)\n 25-	م/ فايقة سلامة                         (معيدة)\n 26-	م/ بسنت محمد بهاء                  (معيدة) ",
              ),
            ],
          ),
        ),
      ),
    );
  }
}
